#+title: The Swift Reflection API and what you can do with it
#+moved: https://appventure.me/guides/swift_reflection/introduction.html
#+tags: swift cocoa ios
#+keywords: feature swift reflection struct class displayType mirror api reflecting any anyobject
#+summary: In this post I'll examine the Swift reflection API, see how fast it is, and will try to show use cases where it can be applied successfully.
#+description: In this post I'll examine the Swift reflection API, see how fast it is, and will try to show use cases where it can be applied successfully.
#+OPTIONS: toc:t 

#+BEGIN_EXPORT html
<h6><a href="http://swift.gg/2015/11/23/swift-reflection-api-what-you-can-do/">This post is also available in <b>🇨🇳Chinese</b></a><span> Thanks to </span><a href="http://swift.gg/tags/APPVENTURE/">SwiftGG</a></h6>
#+END_EXPORT

Even though Swift stresses strong types, compile time safety, static dispatch it still offers a Reflection mechanism as part of the standard library. You may already have seen it in various blog posts or projects like [[http://design.featherless.software/enumerating-tuple-values-swift/?utm_campaign%3DSwift%252BSandbox&utm_medium%3Demail&utm_source%3DSwift_Sandbox_12][here (Tuples)]], [[http://design.featherless.software/enumerate-messages-midipacket-swift-reflection/][here (Midi Packets)]] or [[https://github.com/terhechte/corevalue][here (Core Data).]] Maybe you're interested in using in one of your projects, or you may want to better understand the problem domains on which reflection can be applied. This is an overview of the possibilities of the Swift Reflection API based a talk I held recently at the [[http://www.macoun.de][Macoun conference]] in Frankfurt, Germany.

*** displayStyle

This is easy. It will just return a case of the =DisplayStyle= =enum=. If you're trying to reflect over an unsupported type, you'll get an empty =Optional= back (as explained above).

#+BEGIN_SRC swift :noweb strip-export
<<subject1>>
print (aMirror.displayStyle)
// prints: Optional(Swift.Mirror.DisplayStyle.Struct)
#+END_SRC

#+RESULTS:
: Mirror for Bookmark
: Optional(Swift.Mirror.DisplayStyle.Struct)

*** SuperclassMirror

This is the mirror of the superclass of our subject. If the subject is not a class, this will be an empty =Optional=. If this is a class-based type, you'll get a new =Mirror=:

#+BEGIN_SRC swift :noweb strip-export
<<subject1>>
// try our struct
print(Mirror(reflecting: aBookmark).superclassMirror())
// prints: nil
// try a class
print(Mirror(reflecting: aBookmark.store).superclassMirror())
// prints: Optional(Mirror for Store)

#+END_SRC

#+RESULTS:
: Mirror for Bookmark
: nil
: Optional(Mirror for Store)

